
## Plan Result

[CI link](https://github.com/shimizu-atsuyoshi/live-fire-exercise/actions/runs/16334181860)


<pre><code>Plan: 21 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * module.bastion.aws_iam_instance_profile.this
  * module.bastion.aws_iam_role.this
  * module.bastion.aws_iam_role_policy_attachment.this
  * module.bastion.aws_instance.this
  * module.bastion.aws_security_group.this
  * module.destination_db.aws_rds_cluster_instance.this[0]
  * module.dms.aws_dms_endpoint.source
  * module.dms.aws_dms_endpoint.target
  * module.dms.aws_dms_replication_instance.this
  * module.dms.aws_dms_replication_subnet_group.this
  * module.dms.aws_security_group.this
  * module.internet_gateway.aws_internet_gateway.this
  * module.public_subnets.aws_subnet.this[&#34;live-fire-exercise-public-subnet-a&#34;]
  * module.public_subnets.aws_subnet.this[&#34;live-fire-exercise-public-subnet-c&#34;]
  * module.public_subnets.aws_subnet.this[&#34;live-fire-exercise-public-subnet-d&#34;]
  * module.route_table.aws_route.this
  * module.route_table.aws_route_table.this
  * module.route_table.aws_route_table_association.this[&#34;0&#34;]
  * module.route_table.aws_route_table_association.this[&#34;1&#34;]
  * module.route_table.aws_route_table_association.this[&#34;2&#34;]
  * module.source_db.aws_rds_cluster_instance.this[0]
* Update
  * module.destination_db.aws_rds_cluster.this
  * module.destination_db.aws_security_group.this
  * module.source_db.aws_rds_cluster.this
  * module.source_db.aws_security_group.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.bastion.aws_iam_instance_profile.this will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "live-fire-exercise-bastion-role-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "live-fire-exercise-bastion-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.bastion.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "live-fire-exercise-bastion-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.bastion.aws_iam_role_policy_attachment.this will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "live-fire-exercise-bastion-role"
    }

  # module.bastion.aws_instance.this will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-054400ced365b82a0"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "live-fire-exercise-bastion-role-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "ap-northeast-1"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0d09cbbff1ce5034d"
      + tags                                 = {
          + "Name" = "live-fire-exercise-bastion"
        }
      + tags_all                             = {
          + "Name" = "live-fire-exercise-bastion"
        }
      + tenancy                              = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # module.bastion.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "live-fire-exercise-bastion-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "ap-northeast-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "live-fire-exercise-bastion-sg"
        }
      + tags_all               = {
          + "Name" = "live-fire-exercise-bastion-sg"
        }
      + vpc_id                 = "vpc-0f2bf93064fdc12a4"
    }

  # module.destination_db.aws_rds_cluster.this will be updated in-place
  ~ resource "aws_rds_cluster" "this" {
        id                                    = "destination-cluster"
      ~ skip_final_snapshot                   = false -> true
        tags                                  = {}
        # (56 unchanged attributes hidden)
    }

  # module.destination_db.aws_rds_cluster_instance.this[0] will be created
  + resource "aws_rds_cluster_instance" "this" {
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = "destination-cluster"
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = (known after apply)
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-mysql"
      + engine_version                        = "8.0.mysql_aurora.3.05.2"
      + engine_version_actual                 = (known after apply)
      + force_destroy                         = false
      + id                                    = (known after apply)
      + identifier                            = "destination-cluster-instance"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.medium"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + network_type                          = (known after apply)
      + performance_insights_enabled          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = (known after apply)
      + promotion_tier                        = 0
      + publicly_accessible                   = false
      + region                                = "ap-northeast-1"
      + storage_encrypted                     = (known after apply)
      + tags_all                              = (known after apply)
      + writer                                = (known after apply)
    }

  # module.destination_db.aws_security_group.this will be updated in-place
  ~ resource "aws_security_group" "this" {
        id                     = "sg-00485c7c56a24b2cd"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
                # (1 unchanged attribute hidden)
            },
        ]
        name                   = "destination-cluster-sg"
        tags                   = {
            "Name" = "destination-cluster-sg"
        }
        # (9 unchanged attributes hidden)
    }

  # module.dms.aws_dms_endpoint.source will be created
  + resource "aws_dms_endpoint" "source" {
      + certificate_arn             = (known after apply)
      + database_name               = "sample"
      + endpoint_arn                = (known after apply)
      + endpoint_id                 = "live-fire-exercise-source-endpoint"
      + endpoint_type               = "source"
      + engine_name                 = "aurora"
      + extra_connection_attributes = (known after apply)
      + id                          = (known after apply)
      + kms_key_arn                 = (known after apply)
      + password                    = (sensitive value)
      + port                        = 3306
      + region                      = "ap-northeast-1"
      + server_name                 = "source-cluster.cluster-czyy6e4qqiyr.ap-northeast-1.rds.amazonaws.com"
      + ssl_mode                    = (known after apply)
      + tags_all                    = (known after apply)
      + username                    = "root"

      + redshift_settings (known after apply)
    }

  # module.dms.aws_dms_endpoint.target will be created
  + resource "aws_dms_endpoint" "target" {
      + certificate_arn             = (known after apply)
      + database_name               = "sample"
      + endpoint_arn                = (known after apply)
      + endpoint_id                 = "live-fire-exercise-target-endpoint"
      + endpoint_type               = "target"
      + engine_name                 = "aurora"
      + extra_connection_attributes = (known after apply)
      + id                          = (known after apply)
      + kms_key_arn                 = (known after apply)
      + password                    = (sensitive value)
      + port                        = 3306
      + region                      = "ap-northeast-1"
      + server_name                 = "destination-cluster.cluster-czyy6e4qqiyr.ap-northeast-1.rds.amazonaws.com"
      + ssl_mode                    = (known after apply)
      + tags_all                    = (known after apply)
      + username                    = "root"

      + redshift_settings (known after apply)
    }

  # module.dms.aws_dms_replication_instance.this will be created
  + resource "aws_dms_replication_instance" "this" {
      + allocated_storage                = 8
      + auto_minor_version_upgrade       = false
      + availability_zone                = (known after apply)
      + engine_version                   = (known after apply)
      + id                               = (known after apply)
      + kms_key_arn                      = (known after apply)
      + multi_az                         = false
      + network_type                     = (known after apply)
      + preferred_maintenance_window     = "sun:10:30-sun:14:30"
      + publicly_accessible              = false
      + region                           = "ap-northeast-1"
      + replication_instance_arn         = (known after apply)
      + replication_instance_class       = "dms.t3.micro"
      + replication_instance_id          = "live-fire-exercise"
      + replication_instance_private_ips = (known after apply)
      + replication_instance_public_ips  = (known after apply)
      + replication_subnet_group_id      = (known after apply)
      + tags_all                         = (known after apply)
      + vpc_security_group_ids           = (known after apply)
    }

  # module.dms.aws_dms_replication_subnet_group.this will be created
  + resource "aws_dms_replication_subnet_group" "this" {
      + id                                   = (known after apply)
      + region                               = "ap-northeast-1"
      + replication_subnet_group_arn         = (known after apply)
      + replication_subnet_group_description = "live-fire-exercise subnet group"
      + replication_subnet_group_id          = "live-fire-exercise-subnet-group"
      + subnet_ids                           = [
          + "subnet-02a14967607615850",
          + "subnet-08b1e29330c0951e0",
          + "subnet-0d09cbbff1ce5034d",
        ]
      + tags_all                             = (known after apply)
      + vpc_id                               = (known after apply)
    }

  # module.dms.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "live-fire-exercise-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "ap-northeast-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "live-fire-exercise-sg"
        }
      + tags_all               = {
          + "Name" = "live-fire-exercise-sg"
        }
      + vpc_id                 = "vpc-0f2bf93064fdc12a4"
    }

  # module.internet_gateway.aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "ap-northeast-1"
      + tags     = {
          + "Name" = "live-fire-exercise"
        }
      + tags_all = {
          + "Name" = "live-fire-exercise"
        }
      + vpc_id   = "vpc-0f2bf93064fdc12a4"
    }

  # module.public_subnets.aws_subnet.this["live-fire-exercise-public-subnet-a"] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-1"
      + tags                                           = {
          + "Name" = "live-fire-exercise-public-subnet-a"
        }
      + tags_all                                       = {
          + "Name" = "live-fire-exercise-public-subnet-a"
        }
      + vpc_id                                         = "vpc-0f2bf93064fdc12a4"
    }

  # module.public_subnets.aws_subnet.this["live-fire-exercise-public-subnet-c"] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-1"
      + tags                                           = {
          + "Name" = "live-fire-exercise-public-subnet-c"
        }
      + tags_all                                       = {
          + "Name" = "live-fire-exercise-public-subnet-c"
        }
      + vpc_id                                         = "vpc-0f2bf93064fdc12a4"
    }

  # module.public_subnets.aws_subnet.this["live-fire-exercise-public-subnet-d"] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-northeast-1"
      + tags                                           = {
          + "Name" = "live-fire-exercise-public-subnet-d"
        }
      + tags_all                                       = {
          + "Name" = "live-fire-exercise-public-subnet-d"
        }
      + vpc_id                                         = "vpc-0f2bf93064fdc12a4"
    }

  # module.route_table.aws_route.this will be created
  + resource "aws_route" "this" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "ap-northeast-1"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.route_table.aws_route_table.this will be created
  + resource "aws_route_table" "this" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "ap-northeast-1"
      + route            = (known after apply)
      + tags             = {
          + "Name" = "live-fire-exercise"
        }
      + tags_all         = {
          + "Name" = "live-fire-exercise"
        }
      + vpc_id           = "vpc-0f2bf93064fdc12a4"
    }

  # module.route_table.aws_route_table_association.this["0"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "ap-northeast-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.route_table.aws_route_table_association.this["1"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "ap-northeast-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.route_table.aws_route_table_association.this["2"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "ap-northeast-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.source_db.aws_rds_cluster.this will be updated in-place
  ~ resource "aws_rds_cluster" "this" {
        id                                    = "source-cluster"
      ~ skip_final_snapshot                   = false -> true
        tags                                  = {}
        # (56 unchanged attributes hidden)
    }

  # module.source_db.aws_rds_cluster_instance.this[0] will be created
  + resource "aws_rds_cluster_instance" "this" {
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = "source-cluster"
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = (known after apply)
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-mysql"
      + engine_version                        = "8.0.mysql_aurora.3.05.2"
      + engine_version_actual                 = (known after apply)
      + force_destroy                         = false
      + id                                    = (known after apply)
      + identifier                            = "source-cluster-instance"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.medium"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + network_type                          = (known after apply)
      + performance_insights_enabled          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = (known after apply)
      + promotion_tier                        = 0
      + publicly_accessible                   = false
      + region                                = "ap-northeast-1"
      + storage_encrypted                     = (known after apply)
      + tags_all                              = (known after apply)
      + writer                                = (known after apply)
    }

  # module.source_db.aws_security_group.this will be updated in-place
  ~ resource "aws_security_group" "this" {
        id                     = "sg-0aa568365484e36cb"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
                # (1 unchanged attribute hidden)
            },
        ]
        name                   = "source-cluster-sg"
        tags                   = {
            "Name" = "source-cluster-sg"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 21 to add, 4 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label add-or-update: POST https://api.github.com/repos/shimizu-atsuyoshi/live-fire-exercise/issues/11/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","JobName":"aws-plan","PRNumber":11,"Program":"tfcmt","SHA1":"74531a5fe12c1cf978fa40a467b15d58cbd459ac","Vars":{},"WorkflowName":"aws plan"} -->